package com.example.fitnes

class ExerciseDataBase {
    companion object {
        var exercises = mutableListOf(
            Exercise(
                "Ходьба с подъемом коленей",
                "Начинаем разминку с ходьбы. Поочередно поднимайте колени до уровня параллели бедер с полом. Для лучшего понимания техники представьте, будто маршируете. Руки двигаются, как при обычной ходьбе.",
                15,
                R.drawable.one
            ),
            Exercise(
                "Вращения рук с захлестом голени",
                "Одновременно вращайте руками и поочередно отводите голени назад. Руки полностью выпрямлены. Тяните носок для лучшего разогрева квадрицепсов. Почувствуйте, как разогреваются плечевые суставы и все тело.",
                20,
                R.drawable.two
            ),
            Exercise(
                "Наклоны к полу",
                "Примите стойку по ширине плеч. Руки разведите в стороны. Не сгибая ног, наклонитесь вперед, одновременно касаясь руками пола. Держите ровную осанку. Выполняйте упражнение поочередно на обе стороны.",
                10,
                R.drawable.three
            ),
            Exercise(
                "Вращения таза",
                "Поставьте руки на пояс и начинайте вращать таз сначала по часовой стрелке, а после — против. Выполняйте упражнение в среднем темпе, почувствуйте как разминаются бедра и ягодицы.",
                120,
                R.drawable.four
            ),
            Exercise(
                "Прогиб в спине стоя",
                "Примите позу полуприседа и упритесь руками в колени. Начинайте поочередно прогибаться и сгибаться в пояснице, фиксируя позиции небольшими паузами. Это упражнение подготовит вашу спину к нагрузке.",
                50,
                R.drawable.five
            ),
            Exercise(
                "Приседания с подъемом рук",
                "Делайте присед до прямого угла в сгибе коленного сустава. В верхней фазе тянитесь руками вверх, растягивая все тело. Обязательно выполняйте приседания перед силовыми и интервальными тренировками для подготовки мышц ног к нагрузкам.",
                30,
                R.drawable.six
            ),
            Exercise(
                " Вращения колен",
                "Сведите ноги вместе и обопритесь ладонями на колени. Начинайте медленно вращать колени по часовой и против часовой стрелки, разминая коленные суставы.",
                20,
                R.drawable.seven
            ),
            Exercise(
                "Вращение бедер",
                "Руки зафиксируйте на поясе и выпрямите осанку. Начинайте поднимать бедро, выполняя вращения в сторону и разминая тазобедренный сустав. Нога при этом согнута под прямым углом.",
                20,
                R.drawable.eight
            ),
            Exercise(
                "Боковые выпады",
                "Сведите руки перед собой в замке, примите стойку шире плеч и начинайте поочередно сгибать ноги, делая боковые выпады и хорошо разминая ноги. Спину держите ровно.",
                40,
                R.drawable.nine
            ),
            Exercise(
                "Вращения стоп",
                "Зафиксируйте руки на поясе, приподнимите одну ногу и начинайте выполнять вращения носком по/против часовой стрелки. Разминайте сустав медленно.",
                30,
                R.drawable.ten
            )

        )
    }
}